docs/math/category-theory.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Category Theory</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Category Theory</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-e5f7360b-fb8e-42d5-81c1-09ebe76adfed">1. "Overview"</a></li>
<li><a href="#h-635e48a8-14c9-4acd-80c7-042dac344386">2. Categorification</a></li>
<li><a href="#h-dab505ba-dc33-4821-afd9-a61026f21d21">3. References</a>
<ul>
<li><a href="#h-0cbb1a17-04c0-43d5-96b0-796a13e41527">3.1. Examples of Categorification</a>
<ul>
<li><a href="#h-fce4a7ed-5719-4013-ad56-03335949fca1">3.1.1. 2-Vector Spaces</a></li>
<li><a href="#h-195ba4a7-7c60-4042-8ce2-8cd6a9933c35">3.1.2. Galois Theory</a></li>
<li><a href="#h-a492e195-db18-4872-b961-1c8e864bc279">3.1.3. Number Theory and Stuff</a></li>
<li><a href="#h-a2463813-f502-4be1-bbc4-a3c977a5713c">3.1.4. Polynomials</a></li>
</ul>
</li>
<li><a href="#h-17051e84-5b54-4288-9f67-67d7bc0848c8">3.2. Higher Category Theory</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-e5f7360b-fb8e-42d5-81c1-09ebe76adfed" class="outline-2">
<h2 id="h-e5f7360b-fb8e-42d5-81c1-09ebe76adfed"><span class="section-number-2">1.</span> "Overview"</h2>
<div class="outline-text-2" id="text-h-e5f7360b-fb8e-42d5-81c1-09ebe76adfed">
<p>
I'm not going to pretend to talk about why category theory is useful.
I've written such notes before, it'd be a distraction to re-hash them now.
(It gives us a template to describe mathematical gadgets, basically.
This template itself is a mathematical gadget, so it can be used on
itself.)
</p>

<p>
Category theory exposes the magic underpinning relations like Monstrous
Moonshine, Galois theory, or the Langlands programme (and many many
more).
</p>
</div>
</div>
<div id="outline-container-h-635e48a8-14c9-4acd-80c7-042dac344386" class="outline-2">
<h2 id="h-635e48a8-14c9-4acd-80c7-042dac344386"><span class="section-number-2">2.</span> Categorification</h2>
<div class="outline-text-2" id="text-h-635e48a8-14c9-4acd-80c7-042dac344386">
<p>
Categorification is the process of finding category theoretic
counterparts to classical mathematics. It's defined by
<i>decategorification</i> reproducing a given mathematical gadget.
</p>

<p>
A seemingly dull example is how finite sets are categorified natural
numbers. When we consider formal power series whose coefficients are
particular natural numbers, the categorified counterpart is Feynman
diagrams.
</p>

<p>
This can be related to the process of <a href="category-theory/internalization.html">internalization</a>.
</p>
</div>
</div>
<div id="outline-container-h-dab505ba-dc33-4821-afd9-a61026f21d21" class="outline-2">
<h2 id="h-dab505ba-dc33-4821-afd9-a61026f21d21"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-dab505ba-dc33-4821-afd9-a61026f21d21">
<ul class="org-ul">
<li>Mac Lane's <cite class="book-title">Category Theory for the Working Mathematician</cite>
is the standard text.</li>
<li>Jiří Adámek, Horst Herrlich, George Strecker,
<a href="http://www.tac.mta.ca/tac/reprints/articles/17/tr17abs.html">Abstract and Concrete Categories: The Joy of Cats</a>
(<a href="http://katmat.math.uni-bremen.de/acc/acc.pdf">PDF</a>), a free ebook, pretty good&#x2026;but it's no Mac Lane.</li>
</ul>
</div>
<div id="outline-container-h-0cbb1a17-04c0-43d5-96b0-796a13e41527" class="outline-3">
<h3 id="h-0cbb1a17-04c0-43d5-96b0-796a13e41527"><span class="section-number-3">3.1.</span> Examples of Categorification</h3>
<div class="outline-text-3" id="text-h-0cbb1a17-04c0-43d5-96b0-796a13e41527">
<ul class="org-ul">
<li>John Baez and Michael Shulman,<br>
<a href="https://math.ucr.edu/home/baez/cohomology.pdf">Lectures on n-Categories and Cohomology</a>.</li>
<li>Mikhail Khovanov,<br>
"Heisenberg algebra and a graphical calculus."<br>
Eprint: <a href="https://arxiv.org/abs/1009.3295">arXiv:1009.3295</a> [math.RT], 45 pages.</li>
<li>Alexander Kirillov Jr,<br>
"On the modular functor associated with a finite group."<br>
Eprint: <a href="https://arxiv.org/abs/math/0310087">arXiv:math/0310087</a> [math.QA], 7 pages.</li>
<li>Jacob Lurie,<br>
"Categorification of Fourier Theory".<br>
<a href="https://youtu.be/w3f8KEcv4RE">Youtube lecture</a>, 2015</li>
<li>Ingo Runkel, Jurgen Fuchs, Christoph Schweigert,<br>
"Categorification and correlation functions in conformal field theory."<br>
Eprint: <a href="https://arxiv.org/abs/math/0602079">arXiv:math/0602079</a> [math.CT], 16 pages.
<span class="underline">International Congress of Mathematicians.</span> Vol. III, pages 443–458, Eur. Math. Soc., Zürich, 2006.</li>
</ul>
</div>
<div id="outline-container-h-fce4a7ed-5719-4013-ad56-03335949fca1" class="outline-4">
<h4 id="h-fce4a7ed-5719-4013-ad56-03335949fca1"><span class="section-number-4">3.1.1.</span> 2-Vector Spaces</h4>
<div class="outline-text-4" id="text-h-fce4a7ed-5719-4013-ad56-03335949fca1">
<ul class="org-ul">
<li>John C. Baez and Alissa S. Crans,<br>
"Higher-Dimensional Algebra VI: Lie 2-Algebras".<br>
<a href="http://www.tac.mta.ca/tac/volumes/12/15/12-15abs.html">TAC</a>, 48 pages</li>
<li>Jeffrey C. Morton,<br>
"2-Vector Spaces and Groupoids".<br>
<a href="https://arxiv.org/abs/0810.2361">arXiv:0810.2361</a>, 44 pages.</li>
</ul>
</div>
</div>
<div id="outline-container-h-195ba4a7-7c60-4042-8ce2-8cd6a9933c35" class="outline-4">
<h4 id="h-195ba4a7-7c60-4042-8ce2-8cd6a9933c35"><span class="section-number-4">3.1.2.</span> Galois Theory</h4>
<div class="outline-text-4" id="text-h-195ba4a7-7c60-4042-8ce2-8cd6a9933c35">
<ul class="org-ul">
<li>Theo Johnson-Freyd,<br>
"Spin, statistics, orientations, unitarity".<br>
<a href="https://arxiv.org/abs/1507.06297">arXiv:1507.06297</a>, offers a categorification of Galois theory.
(See also <a href="http://categorified.net/handout-PI-oct2015.pdf">handout</a>)</li>
<li>Deligne's "Categories Tensorielles"<br>
<a href="http://categorified.net/Deligne-CategoriesTensorielles-English.pdf">English translation</a> also discusses categorified Galois theory.</li>
</ul>
</div>
</div>
<div id="outline-container-h-a492e195-db18-4872-b961-1c8e864bc279" class="outline-4">
<h4 id="h-a492e195-db18-4872-b961-1c8e864bc279"><span class="section-number-4">3.1.3.</span> Number Theory and Stuff</h4>
<div class="outline-text-4" id="text-h-a492e195-db18-4872-b961-1c8e864bc279">
<ul class="org-ul">
<li>Quoc P. Ho, Penghui Li,
"Eisenstein series via factorization homology of Hecke categories".
<a href="https://arxiv.org/abs/2103.10137">arXiv:2103.10137</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-a2463813-f502-4be1-bbc4-a3c977a5713c" class="outline-4">
<h4 id="h-a2463813-f502-4be1-bbc4-a3c977a5713c"><span class="section-number-4">3.1.4.</span> Polynomials</h4>
<div class="outline-text-4" id="text-h-a2463813-f502-4be1-bbc4-a3c977a5713c">
<ul class="org-ul">
<li>Syu Kato, Anton Khoroshkin, Ievgen Makedonskyi,
"Categorification of DAHA and Macdonald polynomials".
<a href="https://arxiv.org/abs/2103.10009">arXiv:2103.10009</a>, 37 pages</li>
<li>Mikhail Khovanov, Radmila Sazdanovic,
"Categorification of the polynomial ring."
Eprint: <a href="https://arxiv.org/abs/1101.0293">arXiv:1101.0293</a> [math.QA], 29 pages.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-17051e84-5b54-4288-9f67-67d7bc0848c8" class="outline-3">
<h3 id="h-17051e84-5b54-4288-9f67-67d7bc0848c8"><span class="section-number-3">3.2.</span> Higher Category Theory</h3>
<div class="outline-text-3" id="text-h-17051e84-5b54-4288-9f67-67d7bc0848c8">
<ul class="org-ul">
<li>Tom Leinster,
"A Survey of Definitions of n-Category."
Eprint: <a href="https://arxiv.org/abs/math/0107188">arXiv:math/0107188</a> [math.CT], 67 pages.
<a href="https://www.emis.de/journals/TAC/volumes/10/1/10-01abs.html">Theory Appl. Categ.</a> <b><b>10</b></b> (2002), 1–70.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sun, 11 Apr 2021 12:12:32 -0700
</div>
</body>
</html>
